Revit 2024 API
Ceramic.CeramicApplication Property
 The property labeled "Finish" from the "Ceramic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string CeramicApplication { get; }
Visual Basic
Public Shared ReadOnly Property CeramicApplication As String
	Get
Visual C++
public:
static property String^ CeramicApplication {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "CeramicApplicationType".
See Also
Ceramic Class
Autodesk.Revit.DB.Visual Namespace